MAIN_MENU = "Привет 👋\nДобро пожаловать в nng!\nЗдесь ты можешь выдать себе редактора в одной из групп nng, посмотреть свой профиль или обратиться в поддержку."

ALGOLIA_ANSWER = "❓ Похоже, у нас есть подходящий ответ на твой вопрос:"
ALGOLIA_SUCCESS = "Отлично! Рады, что помогли 😊"

VIOLATION_TYPE_BANNED = "⛔ Блокировка\n"
VIOLATION_TYPE_WARNED = "⚠️ Предупреждение\n"
PROFILE_VIOLATION_HEADING = "Нарушения:\n"

EDITOR_AGREE_WITH_RULES = "📃 Правила\nПрежде чем выдать тебе редактора, ты должен ознакомиться с нашими правилами — https://vk.com/@nnghub-rules\nУ нас так же есть ответы на другие вопросы, что тоже может быть тебе полезным — https://vk.com/@nnghub-faq"
EDITOR_GIVEN_ERROR = "💣 Во время выдачи редактора произошла ошибка"
EDITOR_COOLDOWN = "Не стоит выдавать себе редактора так часто 🙄"
EDITOR_VIOLATION_ACTIVE = (
    "Ты не можешь выдать себе редактора из-за активной блокировки 🐀"
)
EDITOR_USER_AGREED_WITH_RULES = (
    "Отлично! Ты согласился с правилами. Теперь следуй инструкциям в сообщении 🪄"
)
EDITOR_LOG_FAIL = "💣 Не удалось выдать редактора"

INVITES_PAGE = "🔗 Приглашения"
INVITES_INVALID_COMMAND = (
    "Ошибка в команде. Проверь, правильно ли ты указываешь пользователя 🤥"
)
INVITES_VIOLATION_ACTIVE = (
    "У тебя есть активное нарушение, поэтому ты не можешь принять приглашение 🐀"
)
CANT_INVITE_MYSELF = "Ты не можешь принять приглашение от самого себя 🤭"
INVITED_USER_INVALID = "Пользователя, указанного в приглашении не существует 🤨"
INVITES_INVALID_PROFILE = "💣 Похоже, мы потеряли твой профиль"
ALREADY_INVITED_BY_SOMEONE = "Ты уже принял приглашение от другого пользователя 😿"
CANT_BE_INVITED_BY_REFERRAL = (
    "Ты не можешь принять приглашение от того, кого ты сам пригласил 😬"
)
TOO_LOW_REFERRAL_TRUST = "У этого пользователя слишком низкий траст фактор 🐣"
TOO_LOW_TRUST = "У тебя слишком низкий траст фактор 🐣"
INVITE_REFUSE_PAGE = "Запрос на приглашение был отменён 💔"

SUPPORT_PAGE = "🧐 Помощь\nЧто сегодня отправим?"
SUPPORT_UNBLOCK_NOT_BANNED = (
    "Ты не заблокирован, поэтому отправить запрос на разблокировку не выйдет 👁👅👁"
)
SUPPORT_UNBLOCK_INITIAL = "👁️ Этап 1: Подготовка запроса ✍️\nХорошо. Вместе с запросом на разблокировку ты можешь прикрепить примечание. Делать это необязательно, можно отправить без него."
SUPPORT_UNBLOCK_ATTACH_MESSAGE = "👁️ Этап 2: Примечание к разблокировке 💬\nВ случае если ты считаешь, что рассмотрение твоей разблокировки может занять много времени, ты можешь описать обстоятельства своей блокировки. Это ускорит процесс рассмотрения и повысит шансы на разблокировку 🤓"
SUPPORT_UNBLOCK_SUCCESS = "Твой запрос был отправлен. Как только он будет рассмотрен, ты сразу получишь уведомление с решением 🙂"

EDITOR_COMPLAIN = "‼️ Этап 1: Подготовка запроса ✍️\nЕсли какой-то комментарий нарушает правила nng, то отправь нам ссылку на него. Этот комментарий должен быть оставлен именно нашей группой.\n\nВот пример такой ссылки: https://vk.com/wall-147811741_2407?reply=2408"
EDITOR_COMPLAIN_ATTACH_MESSAGE = "‼️ Этап 2: Описание ситуации 💬\nХорошо. Теперь подробно опиши ситуацию. Это поможет ускорить рассмотрение жалобы и повысит шансы на блокировку нарушителя 🐀"

REQUESTS_PAGE = "🦉 Запросы"
REQUESTS_HISTORY_PAGE = "🗃 Архив"

TICKETS_PAGE = "❓ Задать вопрос"
TICKET_CLOSED_FOR_REPLY = "❓ Вопрос закрыт, поэтому ответить на него не получится"
TICKET_ALREADY_CLOSED = "❓ Вопрос уже закрыт"
TICKET_POST_PROMPT = (
    "❓ Суть вопроса\nХорошо. Теперь подробно опиши с какой проблемой ты столкнулся."
)
TICKET_ANSWER_PROMPT = "❓ Ответить на вопрос"
TICKET_ANSWER_ADDED = "✅ Твое сообщение было успешно добавлено к вопросу"
TICKET_CLOSED = "✅ Вопрос успешно закрыт"

FEATURE_INPUT_PROMPT = "🧿 Предложить идею\nЕсли у тебя появились интересные идеи или особые пожелания, мы были бы рады услышать их!\nНам важно мнение каждого пользователя, поэтому мы тщательно и внимательно рассматриваем каждое ваше предложение."
FEATURE_INPUT_SUCCESS = "🧿 Отлично!\n\nМы получили твоё предложение. Вскоре мы восстановим его из /dev/null и дадим обратную связь."

NOT_NNG_COMMENT = (
    "Отправленный тобой комментарий не был оставлен одной из наших групп 👀"
)
INVALID_LINK = "Отправленная тобой ссылка недействительна 🤷‍♂️"
REQUEST_FAILED = "Так как прошло много времени с того момента как ты не дал ответ, мы отменили твой запрос. Подай его ещё раз."
REQUEST_FAILED_SNACKBAR = "Ввиду твоей неактивности, запрос отменён"
INVALID_REQUEST = "💣 Этот запрос недействителен"
BUTTON_BROKEN = "💣 Похоже, эта кнопка сломалась"
UNEXPECTED_ERROR = "💣 Ошибка"

PRIORITY_GREEN = "взаимодействие со стеной, историями или публикация рекламы"
PRIORITY_TEAL = "спам, флуд или нарушение норм платформы ВКонтакте"
PRIORITY_ORANGE = "взаимодействие с оформлением групп"
PRIORITY_RED = "взаимодействие с чёрным списком, списком участников или создание сайта из сообщества"

TICKET_STATUS_UNREVIEWED = "🏃 Ожидает рассмотрения"
TICKET_STATUS_IN_REVIEW = "⌛️ На рассмотрении"
TICKET_STATUS_CLOSED = "☑️ Закрыто"

COMPLAIN_STATUS_APPROVED = "💥 Редактор заблокирован"
COMPLAIN_STATUS_DENIED = "⛔ Отклонено"
REQUEST_STATUS_APPROVED = "✅ Разблокирован"
REQUEST_STATUS_DENIED = "⛔ Отклонён"
REQUEST_STATUS_INVALID = "🤷‍♂️ Неизвестный"

TRUST_LEVEL_MAX = "🤩"
TRUST_LEVEL_HIGH = "😁"
TRUST_LEVEL_MEDIUM = "😊"
TRUST_LEVEL_LOW = "😕"
TRUST_LEVEL_VERY_LOW = "😓️"
